bouffalolab/bl_iot_sdk-components/platform/soc/bl702l/bl702l_std/BSP_Driver/regs/qdec_reg.h
    /* 0x8 : qdec0_value */
    union {
        struct
        {
            uint32_t acc1_val       : 16; /* [15: 0],          r,        0x0 */
            uint32_t acc2_val       : 4;  /* [19:16],          r,        0x0 */
            uint32_t reserved_20_27 : 8;  /* [27:20],       rsvd,        0x0 */
            uint32_t spl_val        : 2;  /* [29:28],          r,        0x0 */
            uint32_t reserved_30_31 : 2;  /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } qdec0_value;

    /* 0xc  reserved */
    uint8_t RESERVED0xc[4];

    /* 0x10 : qdec0_int_en */
    union {
        struct
        {
            uint32_t rpt_rdy_en    : 1;  /* [    0],        r/w,        0x1 */
            uint32_t spl_rdy_en    : 1;  /* [    1],        r/w,        0x0 */
            uint32_t dbl_rdy_en    : 1;  /* [    2],        r/w,        0x0 */
            uint32_t overflow_en   : 1;  /* [    3],        r/w,        0x0 */
            uint32_t reserved_4_31 : 28; /* [31: 4],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } qdec0_int_en;

    /* 0x14 : qdec0_int_sts */
    union {
        struct
        {
            uint32_t rpt_rdy_sts   : 1;  /* [    0],          r,        0x0 */
            uint32_t spl_rdy_sts   : 1;  /* [    1],          r,        0x0 */
            uint32_t dbl_rdy_sts   : 1;  /* [    2],          r,        0x0 */
            uint32_t overflow_sts  : 1;  /* [    3],          r,        0x0 */
            uint32_t reserved_4_31 : 28; /* [31: 4],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } qdec0_int_sts;

    /* 0x18 : qdec0_int_clr */
    union {
        struct
        {
            uint32_t rpt_rdy_clr   : 1;  /* [    0],        w1c,        0x0 */
            uint32_t spl_rdy_clr   : 1;  /* [    1],        w1c,        0x0 */
            uint32_t dbl_rdy_clr   : 1;  /* [    2],        w1c,        0x0 */
            uint32_t overflow_clr  : 1;  /* [    3],        w1c,        0x0 */
            uint32_t reserved_4_31 : 28; /* [31: 4],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } qdec0_int_clr;

    /* 0x1c  reserved */
    uint8_t RESERVED0x1c[36];

    /* 0x40 : qdec1_ctrl0 */
    union {
        struct
        {
            uint32_t qdec_en        : 1;  /* [    0],        r/w,        0x0 */
            uint32_t led_en         : 1;  /* [    1],        r/w,        0x0 */
            uint32_t led_pol        : 1;  /* [    2],        r/w,        0x1 */
            uint32_t deg_en         : 1;  /* [    3],        r/w,        0x0 */
            uint32_t deg_cnt        : 4;  /* [ 7: 4],        r/w,        0x0 */
            uint32_t spl_period     : 4;  /* [11: 8],        r/w,        0x2 */
            uint32_t rpt_period     : 16; /* [27:12],        r/w,        0xa */
            uint32_t reserved_28_31 : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } qdec1_ctrl0;

    /* 0x44 : qdec1_ctrl1 */
    union {
        struct
        {
            uint32_t acc_mode       : 1;  /* [    0],        r/w,        0x1 */
            uint32_t spl_mode       : 1;  /* [    1],        r/w,        0x0 */
            uint32_t rpt_mode       : 1;  /* [    2],        r/w,        0x0 */
            uint32_t input_swap     : 1;  /* [    3],        r/w,        0x0 */
            uint32_t reserved_4_15  : 12; /* [15: 4],       rsvd,        0x0 */
            uint32_t led_period     : 9;  /* [24:16],        r/w,        0x0 */
            uint32_t reserved_25_31 : 7;  /* [31:25],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } qdec1_ctrl1;

    /* 0x48 : qdec1_value */
    union {
        struct
        {
            uint32_t acc1_val       : 16; /* [15: 0],          r,        0x0 */
            uint32_t acc2_val       : 4;  /* [19:16],          r,        0x0 */
            uint32_t reserved_20_27 : 8;  /* [27:20],       rsvd,        0x0 */
            uint32_t spl_val        : 2;  /* [29:28],          r,        0x0 */
            uint32_t reserved_30_31 : 2;  /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } qdec1_value;

    /* 0x4c  reserved */
    uint8_t RESERVED0x4c[4];

    /* 0x50 : qdec1_int_en */
    union {
        struct
        {
            uint32_t rpt_rdy_en    : 1;  /* [    0],        r/w,        0x1 */
            uint32_t spl_rdy_en    : 1;  /* [    1],        r/w,        0x0 */
            uint32_t dbl_rdy_en    : 1;  /* [    2],        r/w,        0x0 */
            uint32_t overflow_en   : 1;  /* [    3],        r/w,        0x0 */
            uint32_t reserved_4_31 : 28; /* [31: 4],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } qdec1_int_en;

    /* 0x54 : qdec1_int_sts */
    union {
        struct
        {
            uint32_t rpt_rdy_sts   : 1;  /* [    0],          r,        0x0 */
            uint32_t spl_rdy_sts   : 1;  /* [    1],          r,        0x0 */
            uint32_t dbl_rdy_sts   : 1;  /* [    2],          r,        0x0 */
            uint32_t overflow_sts  : 1;  /* [    3],          r,        0x0 */
            uint32_t reserved_4_31 : 28; /* [31: 4],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } qdec1_int_sts;

    /* 0x58 : qdec1_int_clr */
    union {
        struct
        {
            uint32_t rpt_rdy_clr   : 1;  /* [    0],        w1c,        0x0 */
            uint32_t spl_rdy_clr   : 1;  /* [    1],        w1c,        0x0 */
            uint32_t dbl_rdy_clr   : 1;  /* [    2],        w1c,        0x0 */
            uint32_t overflow_clr  : 1;  /* [    3],        w1c,        0x0 */
            uint32_t reserved_4_31 : 28; /* [31: 4],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } qdec1_int_clr;

    /* 0x5c  reserved */
    uint8_t RESERVED0x5c[36];

    /* 0x80 : qdec2_ctrl0 */
    union {
        struct
        {
            uint32_t qdec_en        : 1;  /* [    0],        r/w,        0x0 */
            uint32_t led_en         : 1;  /* [    1],        r/w,        0x0 */
            uint32_t led_pol        : 1;  /* [    2],        r/w,        0x1 */
            uint32_t deg_en         : 1;  /* [    3],        r/w,        0x0 */
            uint32_t deg_cnt        : 4;  /* [ 7: 4],        r/w,        0x0 */
            uint32_t spl_period     : 4;  /* [11: 8],        r/w,        0x2 */
            uint32_t rpt_period     : 16; /* [27:12],        r/w,        0xa */
            uint32_t reserved_28_31 : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } qdec2_ctrl0;

